a = {
    "舆情总量": "203例",
    "涉及医院舆情总量": "50例",
    "涉及警情的舆情总量": "100例",
    "涉及采购的舆情总量": "53例",
    # 涉及很多类型的舆情总量
    "平台详情": [
        {
            "平台": "微博",
            "标签走势": {
                "涉医院": "2例",
                "涉警": "6例",
                "涉采购": "1例",
            },
            "微博舆情总量": "50例",
            "舆情列表": [
                {"舆情1": {
                    "标题": "（涉医院）网民反映福神整形医院违法违规手术",
                    "内容": "其在福神整形医院两次隆鼻手术均失败，院方态度恶劣拒绝负责，经投诉知该医院已被吊销整形外科资质，私自手术属违法违规行为，希望得到有关部门关注。",
                    "时间": "10月30日",
                    "网名": "露西 ",
                    "标签": "涉医院",
                }},
                {"舆情2": {
                    "标题": "（涉政府采购）网民反映威海政府采购项目候选人存在重大违法记录",
                    "内容": "在威海市机关事务服务中心威海市交警一大队暖气系统及卫生间相关设施修缮、威海市体育运动学校市体校场馆消防等设施维修改造工程、威海市公安局经济技术开发区分局韩乐坊警务工作站工程项目中，中标候选人之一的河南省祁湾建筑公司，存在重大违法记录，没有资格参加政府采购，希望采购人应该加强监管，维护公平公正诚信。",
                    "时间": "10月31日",
                    "网名": "XM家国天下",
                    "标签": "涉政府采购",
                }},
            ],

        },
        {
            "平台": "腾讯新闻",
            "标签": {
                "涉医院": "2例",
                "涉警": "6例",
                "涉采购": "1例",
            },
            "腾讯新闻舆情总量": "50例",
            "舆情列表": [
                {"舆情1": {
                    "标题": "（涉医院）网民反映福神整形医院违法违规手术",
                    "内容": "其在福神整形医院两次隆鼻手术均失败，院方态度恶劣拒绝负责，经投诉知该医院已被吊销整形外科资质，私自手术属违法违规行为，希望得到有关部门关注。",
                    "时间": "10月30日",
                    "网名": "露西 ",
                    "标签": "涉医院",
                }},
                {"舆情2": {
                    "标题": "（涉政府采购）网民反映威海政府采购项目候选人存在重大违法记录",
                    "内容": "在威海市机关事务服务中心威海市交警一大队暖气系统及卫生间相关设施修缮、威海市体育运动学校市体校场馆消防等设施维修改造工程、威海市公安局经济技术开发区分局韩乐坊警务工作站工程项目中，中标候选人之一的河南省祁湾建筑公司，存在重大违法记录，没有资格参加政府采购，希望采购人应该加强监管，维护公平公正诚信。",
                    "时间": "10月31日",
                    "网名": "XM家国天下",
                    "标签": "涉政府采购",
                }},
            ],
        }
    ],
    "汇总展示(按平台汇总)": {
        "微博百分比": "微博舆情总量/舆情总量",
        "腾讯新闻": "腾讯新闻舆情总量/舆情总量",
        "百度新闻": "百度新闻舆情总量/舆情总量",
    },
    "汇总展示(按标签汇总)": [{
        "涉医院百分比": "涉及医院舆情总量/舆情总量",
        "涉警百分比": "涉及警情的舆情总量/舆情总量",
        "涉采购百分比": "涉及采购的舆情总量/舆情总量",
    }],
}

b = [
    {
        'platform': '腾讯新闻',
        'sentimentList': [{
            'sentiment_1': {
                'title': '网民反映福神整形医院违法违规手术',
                'content': '其在福神整形医院两次隆鼻手术均失败，院方态度恶劣拒绝负责，经投诉知该医院已被吊销整形外科资质，私自手术属违法违规行为，希望得到有关部门关注。',
                'time': '10月30日',
                'nickname': '露西\xa0',
                'label': '涉医院'
            }
        }]
    }, {
        'platform': '新浪微博',
        'sentimentList': [{
            'sentiment_1': {
                'title': '网民反映威海政府采购项目候选人存在重大违法记录',
                'content': '在威海市机关事务服务中心威海市交警一大队暖气系统及卫生间相关设施修缮、威海市体育运动学校市体校场馆消防等设施维修改造工程、威海市公安局经济技术开发区分局韩乐坊警务工作站工程项目中，中标候选人之一的河南省祁湾建筑公司，存在重大违法记录，没有资格参加政府采购，希望采购人应该加强监管，维护公平公正诚信。',
                'time': '10月31日',
                'nickname': 'XM家国天下',
                'label': '涉政府采购'
            }
        }]
    }, {
        'platform': '新浪微博',
        'platformTotal': '待定',
        'sentimentList': [{
            'sentiment_1': {
                'title': '网民称鼎苑别墅物业乱作为',
                'content': '威海鼎苑别墅为威海政府后花园，物业随意罚款和限制出入。',
                'time': '10月31日',
                'nickname': 'wh大鹏',
                'label': '涉物业'
            }
        }]
    }, {
        'platform': '新浪微博',
        'platformTotal': '待定',
        'sentimentList': [{
            'sentiment_1': {
                'title': '网民反映举报后被询问身份信息',
                'content': '威海市公安局指控其手机信号出现在疫区日照，指派2个下属派出所查问其身份信息，其前期举报多名司法案件以及腐败分子，质疑借由处置。',
                'time': '10月29日',
                'nickname': '小平板呀小平板',
                'label': '涉警'
            }
        }]
    }]
